dashoffice_cjr/app/controllers/api_controller.rb

    def authenticate_token
        authenticate_with_http_token do |token, options|
            @user = User.find_by(access_token: token)
---
SELECT  "users".* FROM "users" WHERE "users"."access_token" = $1 LIMIT $2  [["access_token", "Y3Tsvj-g9LGAHv_yBLPM"], ["LIMIT", 1]]