dashoffice_cjr/app/views/devise/registrations/new.html.erb

                autofocus: true%>
    <%= f.input :core_id,
                  collection: Core.all,
                  required: true
                  %>
    <%= f.input :role_id,
                  collection: Role.all,
                  required: true
---
SELECT "cores".* FROM "cores"
SELECT "roles".* FROM "roles"