dashoffice_cjr/app/controllers/v1/customers_controller.rb

        def create
            @customer = Customer.new(customer_params)
            if @customer.save
---
INSERT INTO "customers" ("name", "email", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Diegod"], ["email", "diegod@diegod.diegod"], ["phone", "61-DDDDDDDD"], ["created_at", "2019-05-09 14:04:22.901845"], ["updated_at", "2019-05-09 14:04:22.901845"]]

        def destroy
            @customer = Customer.find params[:id]
            @customer.destroy
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 5003], ["LIMIT", 1]]
DELETE FROM "customers" WHERE "customers"."id" = $1  [["id", 5003]]